{"loss": "unet_crossentropy_loss_sampled", "optimizer": {"nesterov": false, "lr": 0.009999999776482582, "name": "SGD", "momentum": 0.949999988079071, "decay": 0.0}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 572, 572], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "maxpooling2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "convolution2d_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "convolution2d_8"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "dropout_1"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "maxpooling2d_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "convolution2d_9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "convolution2d_10"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "dropout_2"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "upsampling2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 2}, "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "name": "convolution2d_11"}, {"class_name": "Lambda", "config": {"function": "c\u0002\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s4\u0000\u0000\u0000|\u0001\u0000}\u0002\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\u0002\u0000|\u0002\u0000\u000b\u0085\u0002\u0000|\u0002\u0000|\u0002\u0000\u000b\u0085\u0002\u0000f\u0004\u0000\u0019S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000xt\u0002\u0000\u0000\u0000cst\b\u0000\u0000\u0000cropSize(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0006\u0000\u0000\u0000try.pyt\n\u0000\u0000\u0000crop_layer\u0081\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0006\u0001", "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {"cs": 4}, "output_shape": [512, 56, 56], "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "lambda_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_11", 0, 0], ["lambda_1", 0, 0]]], "name": "merge_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution2d_12"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_12", 0, 0]]], "name": "convolution2d_13"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "upsampling2d_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 2}, "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "name": "convolution2d_14"}, {"class_name": "Lambda", "config": {"function": "c\u0002\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s4\u0000\u0000\u0000|\u0001\u0000}\u0002\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\u0002\u0000|\u0002\u0000\u000b\u0085\u0002\u0000|\u0002\u0000|\u0002\u0000\u000b\u0085\u0002\u0000f\u0004\u0000\u0019S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000xt\u0002\u0000\u0000\u0000cst\b\u0000\u0000\u0000cropSize(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0006\u0000\u0000\u0000try.pyt\n\u0000\u0000\u0000crop_layer\u0081\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0006\u0001", "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {"cs": 16}, "output_shape": [256, 104, 104], "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "lambda_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_14", 0, 0], ["lambda_2", 0, 0]]], "name": "merge_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_15"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_16", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "convolution2d_16"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_3", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_16", 0, 0]]], "name": "upsampling2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_17", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 2}, "inbound_nodes": [[["upsampling2d_3", 0, 0]]], "name": "convolution2d_17"}, {"class_name": "Lambda", "config": {"function": "c\u0002\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s4\u0000\u0000\u0000|\u0001\u0000}\u0002\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\u0002\u0000|\u0002\u0000\u000b\u0085\u0002\u0000|\u0002\u0000|\u0002\u0000\u000b\u0085\u0002\u0000f\u0004\u0000\u0019S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000xt\u0002\u0000\u0000\u0000cst\b\u0000\u0000\u0000cropSize(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0006\u0000\u0000\u0000try.pyt\n\u0000\u0000\u0000crop_layer\u0081\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0006\u0001", "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {"cs": 40}, "output_shape": [128, 200, 200], "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "lambda_3"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_17", 0, 0], ["lambda_3", 0, 0]]], "name": "merge_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_18", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "convolution2d_18"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_19", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_18", 0, 0]]], "name": "convolution2d_19"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_4", "size": [2, 2]}, "inbound_nodes": [[["convolution2d_19", 0, 0]]], "name": "upsampling2d_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_20", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 2, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 2}, "inbound_nodes": [[["upsampling2d_4", 0, 0]]], "name": "convolution2d_20"}, {"class_name": "Lambda", "config": {"function": "c\u0002\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000C\u0000\u0000\u0000s4\u0000\u0000\u0000|\u0001\u0000}\u0002\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\u0002\u0000|\u0002\u0000\u000b\u0085\u0002\u0000|\u0002\u0000|\u0002\u0000\u000b\u0085\u0002\u0000f\u0004\u0000\u0019S(\u0001\u0000\u0000\u0000N(\u0000\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000xt\u0002\u0000\u0000\u0000cst\b\u0000\u0000\u0000cropSize(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0006\u0000\u0000\u0000try.pyt\n\u0000\u0000\u0000crop_layer\u0081\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u0006\u0001", "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {"cs": 88}, "output_shape": [64, 392, 392], "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "lambda_4"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["convolution2d_20", 0, 0], ["lambda_4", 0, 0]]], "name": "merge_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_21", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "convolution2d_21"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_22", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_21", 0, 0]]], "name": "convolution2d_22"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_23", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "nb_row": 1}, "inbound_nodes": [[["convolution2d_22", 0, 0]]], "name": "convolution2d_23"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["convolution2d_23", 0, 0]]], "name": "flatten_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["flatten_1", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}